---
kind: type
id: T:Autodesk.Revit.DB.Events.ApplicationInitializedEventArgs
source: html/a2cd37be-e16f-24ce-e100-8ae8c6588d73.htm
---
# Autodesk.Revit.DB.Events.ApplicationInitializedEventArgs

The event arguments used by the ApplicationLaunched event.

## Syntax (C#)
```csharp
public class ApplicationInitializedEventArgs : RevitAPISingleEventArgs
```